# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [2]:
import numpy as np
import pandas as pd

### 2. Create a Pandas Series containing the elements of the list below.

In [6]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [7]:
df = pd.DataFrame(lst)

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [9]:
df.iloc[2]

0    74.4
Name: 2, dtype: float64

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [11]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [13]:
new_df = pd.DataFrame(b)
new_df

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [14]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [16]:
new_df.columns = colnames
new_df

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [22]:
subset_df = new_df.iloc[1:6:2].copy()
subset_df

   Score_1  Score_2  Score_3  Score_4  Score_5
1     61.3     40.8     30.8     37.8     87.6
3     57.4      0.1     96.1      4.2     69.5
5     49.0     69.0      0.1     31.8     89.1

In [31]:
print(new_df.describe())

        Score_1   Score_2    Score_3    Score_4    Score_5
count  10.00000  10.00000  10.000000  10.000000  10.000000
mean   54.62000  50.11000  56.950000  47.280000  63.250000
std    25.64899  32.12204  30.168278  31.393446  24.562313
min    20.60000   0.10000   0.100000   4.200000  26.900000
25%    32.95000  29.55000  43.450000  25.050000  39.450000
50%    55.25000  40.75000  53.600000  36.400000  69.000000
75%    70.60000  72.15000  80.925000  79.300000  85.300000
max    96.60000  96.40000  96.100000  88.800000  91.800000

### 7. From the original data frame, calculate the average Score_3 value.

In [25]:
avg_score_3 = new_df["Score_3"].mean()
avg_score_3

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [30]:
max_score_4 = new_df["Score_4"].max()
max_score_4

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [33]:
median_score_2 = new_df["Score_2"].median()
median_score_2

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [35]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [42]:
df_products = pd.DataFrame.from_dict(orders)
df_products
df_products.describe()

          Quantity  UnitPrice     Revenue
count    10.000000  10.000000   10.000000
mean    297.800000   2.447000   63.700000
std     907.414128   3.606944  160.734927
min       1.000000   0.180000    1.650000
25%       1.250000   0.625000    2.050000
50%       5.500000   1.250000    8.950000
75%      20.500000   1.650000   18.150000
max    2880.000000  11.950000  518.400000

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [39]:
quantity_ordered = df_products["Quantity"].sum()
print(quantity_ordered)

total_revenue = df_products["Revenue"].sum()
total_revenue

2978

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [43]:
most_expensive = df_products["UnitPrice"].max()
least_expensive = df_products["UnitPrice"].min()
difference = most_expensive - least_expensive
print(difference)

0.18
11.77